In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
% matplotlib inline

In [3]:
fifa = pd.read_csv('match_results.csv')

In [4]:
fifa.head(2)

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False

In [5]:
fifa.shape

(38898, 9)

In [6]:
fifa.isnull().sum()

date          0
home_team     0
away_team     0
home_score    0
away_score    0
tournament    0
city          0
country       0
neutral       0
dtype: int64

In [7]:
fifa.dtypes

date          object
home_team     object
away_team     object
home_score     int64
away_score     int64
tournament    object
city          object
country       object
neutral         bool
dtype: object

In [9]:
fifa.head(5)

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

In [10]:
fifa1 = fifa.iloc[:,[0,1,2,3,4]]

In [11]:
fifa1.head(2)

         date home_team away_team  home_score  away_score
0  1872-11-30  Scotland   England           0           0
1  1873-03-08   England  Scotland           4           2

In [12]:
fifa1['date'] = pd.to_datetime(fifa1.date)

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [14]:
fifa1.dtypes

date          datetime64[ns]
home_team             object
away_team             object
home_score             int64
away_score             int64
dtype: object

In [15]:
fifa1['date1'] = fifa1.date.dt.year

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [16]:
fifa1.head()

        date home_team away_team  home_score  away_score  date1
0 1872-11-30  Scotland   England           0           0   1872
1 1873-03-08   England  Scotland           4           2   1873
2 1874-03-07  Scotland   England           2           1   1874
3 1875-03-06   England  Scotland           2           2   1875
4 1876-03-04  Scotland   England           3           0   1876

In [17]:
fifa2 = fifa1[fifa1['date1'].isin([2010, 2014,2018]) ]

In [18]:
fifa2.head(2)

            date home_team  away_team  home_score  away_score  date1
31408 2010-01-02      Iran  Korea DPR           1           0   2010
31409 2010-01-02     Qatar       Mali           0           0   2010

In [19]:
fifa2.shape

(1823, 6)

In [20]:
fifa_stats = pd.read_csv('fifa_stats.csv')

In [22]:
fifa_stats.head(2)

,age,dob,full_name,image,nation,potential,rating,short_name,value,wage,year,fifa_rank
0,23,"Feb 2, 1994",E. Hysaj,https://cdn.sofifa.org/1x/18/players/210864.png,Albania,84.0,80.0,E. Hysaj,16.0,58.0,2010,0.488283
1,22,"Mar 19, 1995",T. Strakosha,https://cdn.sofifa.org/1x/18/players/212151.png,Albania,1.0,79.0,T. Strakosha,89.0,1.0,2010,0.878615

In [28]:
fifa_agg = fifa_stats.loc[:,['nation','rating',
                  'year'] ].groupby(['nation', 'year']).mean()

In [30]:
fifarank = pd.read_csv('fifa_rank.csv')

In [31]:
fifarank.head()

  Unnamed: 0  Value of Starting 11  Fifa Ranking
0     Russia                   855            66
1     Brazil                   933             2
2       Iran                   778            36
3      Japan                   839            60
4     Mexico                   863            15

In [32]:
fifa_agg.head(1)

                  rating
nation      year
Afghanistan 2018    59.5

In [33]:
fifa2.head(1)

            date home_team  away_team  home_score  away_score  date1
31408 2010-01-02      Iran  Korea DPR           1           0   2010

In [35]:
fifa2['label'] = 2

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [39]:
index_label0 = fifa2[fifa2['home_score'] > fifa2['away_score']].index

In [38]:
index_label1 = fifa2[fifa2['home_score'] < fifa2['away_score']].index

In [43]:
fifa2.loc[index_label0,'label'] = 0

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/pandas/core/indexing.py:537: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [44]:
fifa2.loc[index_label1,'label'] = 1

/Users/levin/projects/python-data-science/.venv/lib/python3.6/site-packages/pandas/core/indexing.py:537: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [45]:
fifa2.head()

            date home_team   away_team  home_score  away_score  date1  label
31408 2010-01-02      Iran   Korea DPR           1           0   2010      0
31409 2010-01-02     Qatar        Mali           0           0   2010      2
31410 2010-01-02     Syria    Zimbabwe           6           0   2010      0
31411 2010-01-02     Yemen  Tajikistan           0           1   2010      1
31412 2010-01-03    Angola      Gambia           1           1   2010      2